Autodesk.Revit.DB.PartMaker.SetSourceElementIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Set the source elements for the PartMaker.
sourceElementIds:
Elements to be the sources for this PartMaker.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more element ids was not permitted to be a source for this PartMaker
Elements should be Parts that have no PartMaker yet
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMaker.GetSourceElementIds
Get the source elements for the PartMaker.
Returns:
Elements that are the sources for this PartMaker.
Since:
2013

Autodesk.Revit.DB.PartMaker.IsSourceElement(Autodesk.Revit.DB.ElementId)
Is the element a source for this PartMaker
Returns:
Returns true if elemId is among the source elements of this PartMaker
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.PartMaker
PartMaker is an element which takes some source elements (e.g., a wall
with all its layers) and creates one or more Parts out of it. The logic
according to which these Parts are created is non-trivial and PartMaker
uses various PartMakerMethods which represents these logics.
This element manages the strategy to make Part elements for one or more original elements.
Since:
2012